#Задача «Самая простая задача на свете».
n = int(input())

print('Купи конструктор!' * n)