#Задача «Автоматизируем простоту!».
n = int(input())
favorite_activity = input()

print(f"Обожаю писать \"{favorite_activity}\", " * n)
